const DemonCards = [
    {
        name: "冰彈",
        cost: null,
        effect: "對敵人造成 3 傷害，施加凍傷",
        charge: ["正義"]
    },
    {
        name: "血之護盾",
        cost: null,
        effect: "自身獲得 2 格擋，暫時獲得能力血之護甲",
        charge: ["尊嚴"]
    },
    {
        name: "冰霜破碎",
        cost: null,
        effect: "對敵人造成 2 傷害；若目標處於凍傷狀態，額外造成 3 傷害",
        charge: ["正義"]
    },
    {
        name: "銳爪",
        cost: ["正義"],
        effect: "對敵人造成 5 傷害，為自身回復 2 HP",
        charge: ["正義"]
    },
    {
        name: "弱化",
        cost: ["慈悲"],
        effect: "敵人施加虛弱，侵蝕",
        charge: ["慈悲"]
    },
    {
        name: "冰霜護盾",
        cost: ["尊嚴"],
        effect: "自身獲得 7 格擋，獲得凍傷之壁",
        charge: ["尊嚴"]
    },
    {
        name: "寒冰地獄",
        cost: ["正義", "正義"],
        effect: "對敵人造成 7 傷害，施加凍傷×2",
        charge: ["正義"]
    },
    {
        name: "黑暗氣息",
        cost: ["正義", "正義"],
        effect: "自身獲得追擊，冷徹，暫時獲得能力血爪",
        charge: null
    },
    {
        name: "虛弱",
        cost: ["慈悲","慈悲"],
        effect: "所有敵人施加虛弱，2 個侵蝕",
        charge: ["慈悲"]
    },
    {
        name: "吸血之爪",
        cost: ["正義"],
        effect: "對敵人造成 4 傷害，回復等同於造成傷害的 HP",
        charge: ["正義"]
    },
    {
      name: "魔之覺醒—第一幕—",
      cost: ["智慧"],
      effect: "自身獲得2個冷徹，2個血之護佑，暫時將魔之覺醒—第二幕—加入牌組中的隨機位置，暫時從牌組中移除",
      charge: ["智慧"]
    },
    {
      name: "冰霜世界",
      cost: null,
      effect: "自身獲得血之護佑，冷卻之軀",
      charge: ["正義","正義","正義"]
    },
    {
      name: "冰錐之牆",
      cost: ["尊嚴","尊嚴"],
      effect: "我方全體賦予 5 格擋，自身獲得凍傷",
      charge: ["尊嚴"]
    },
    {
      name: "黑暗奔流",
      cost: ["正義","正義"],
      effect: "對所有敵人造成 6 傷害，施加侵蝕",
      charge: ["正義","正義"]
    },
    {
      name: "黑暗護盾",
      cost: ["慈悲","慈悲"],
      effect: "一名友軍賦予 6 格擋，賦予純淨之壁",
      charge: ["正義","慈悲"]
    },
    {
      name: "深淵束縛",
      cost: ["慈悲","慈悲"],
      effect: "對敵人造成 7 傷害，施加束縛，2 個侵蝕",
      charge: ["慈悲"]
    },
    {
      name: "撕裂之爪",
      cost: ["正義", "慈悲"],
      effect: "對敵人造成 6 傷害；若目標處於侵蝕或弱化狀態，額外造成每層 × 3 傷害",
      charge: ["正義"]
    },
    {
      name: "冰封山",
      cost: ["智慧","智慧"],
      effect: "對敵人造成 7 傷害，我方全體賦予 2 個血之護佑",
      charge: ["智慧"]
    },
    {
      name: "靈魂吸收",
      cost: ["正義","正義","正義"],
      effect: "對所有敵人造成 6 傷害，回復等同於造成傷害的 HP，從敵人偷取 2 個有益狀態，暫時從牌組中移除",
      charge: null
    },
    {
      name: "冰封寒氣",
      cost: ["正義", "正義"],
      effect: "若自身處於冷徹狀態，解除所有敵人2個有益狀態，對目標造成每層 × 2 傷害，暫時從牌組中移除",
      charge: ["正義","正義"]
    },
    {
      name: "惡夢",
      cost: ["慈悲","慈悲"],
      effect: "對敵人造成 8 傷害；對SKILL的目標追加施加睡眠，暫時從牌組中移除",
      charge: ["慈悲"]
    },
    {
      name: "冰獄的審判",
      cost: ["智慧", "智慧", "智慧"],
      effect: "自身獲得多重詠唱，2 個冷徹，我方全體賦予凍傷×2",
      charge: ["智慧","智慧"]
    },
    {
      name: "地獄絕對零度",
      cost: ["正義", "正義", "正義"],
      effect: "對所有敵人造成 23 傷害，自身獲得凍傷，麻痺",
      charge: ["正義"]
    },
    {
      name: "冰霜結界",
      cost: ["尊嚴", "尊嚴"],
      effect: "一名友軍賦予 6 格擋，自身獲得護盾，暫時從牌組中移除",
      charge: ["尊嚴"]
    },
    {
      name: "血腥一擊",
      cost: ["正義","正義","正義"],
      effect: "對敵人造成 12 傷害；若自身處於虛弱或血之護佑狀態，對目標額外造成每層 × 4 傷害",
      charge: ["正義"]
    },
    {
      name: "魔之覺醒—第二幕—",
      cost: ["智慧"],
      effect: "自身獲得 2 個冷徹，3 個血之護佑，暫時將魔之覺醒—終幕—加入牌組中的隨機位置，暫時從牌組中移除",
      charge: ["智慧"]
    },
    {
      name: "魔之覺醒—終幕—",
      cost: null,
      effect: "自身獲得2 個冷徹，3 個血之護佑，超多重詠唱",
      charge: ["尊嚴","智慧","慈悲"]
    }
  ];