const KoboldCards = [
    {
      name: "狗頭人突襲",
      cost: null,
      effect: "對敵人造成 2 傷害；若自己上一回合也使用過同名卡牌，則基礎傷害變為 3 倍",
      charge: ["尊嚴"]
    },
    {
      name: "防禦",
      cost: null,
      effect: "自身獲得 4 格擋",
      charge: ["智慧"]
    },
    {
      name: "擺好架勢",
      cost: null,
      effect: "自身獲得蓄力，頑強",
      charge: ["正義"]
    },
    {
      name: "狗頭人攻擊",
      cost: ["慈悲"],
      effect: "對敵人造成 7 傷害，自身獲得弱化",
      charge: ["慈悲"]
    },
    {
      name: "扭扭挑釁",
      cost: ["尊嚴"],
      effect: "自身獲得 5 格擋，獲得挑釁",
      charge: ["尊嚴"]
    },
    {
      name: "野性之力",
      cost: ["智慧"],
      effect: "自身獲得怪力，憤怒",
      charge: ["智慧"]
    },
    {
      name: "狗頭人斬擊",
      cost: ["尊嚴"],
      effect: "對所有敵人造成 3 傷害；若目標的格擋被破壞，追加獲得怪力",
      charge: ["尊嚴"]
    },
    {
      name: "攻守兼備",
      cost: ["正義"],
      effect: "我方全體賦予怪力，頑強",
      charge: ["正義"]
    },
    {
      name: "狂暴",
      cost: ["尊嚴","慈悲"],
      effect: "自身獲得 2 格擋，獲得憤怒，挑釁，頑強",
      charge: ["尊嚴","慈悲"]
    },
    {
      name: "群狼嚎叫",
      cost: ["尊嚴", "尊嚴"],
      effect: "對敵人造成 11 傷害，自身獲得頑強，挑釁",
      charge: ["尊嚴","尊嚴"]
    },
    {
      name: "野獸步伐",
      cost: ["智慧"],
      effect: "行動順序反轉，獲得警戒，暫時從牌組中移除",
      charge: ["智慧","智慧","智慧"]
    },
    {
      name: "野獸斬擊",
      cost: ["正義", "正義"],
      effect: "對敵人造成 13 傷害；若自身處於憤怒狀態，對目標額外造成每層 × 5 傷害",
      charge: ["正義"]
    },
    {
      name: "汪汪招架",
      cost: ["正義", "正義"],
      effect: "自身獲得反彈",
      charge: ["正義"]
    },
    {
      name: "刀刃之舞",
      cost: ["尊嚴", "尊嚴", "尊嚴"],
      effect: "對敵人造成 14 傷害；若自己上一回合也使用過同名卡牌，則基礎傷害變為 2 倍",
      charge: ["尊嚴"]
    },
    {
      name: "領袖號令",
      cost: ["尊嚴", "尊嚴", "尊嚴"],
      effect: "一名友軍賦予蓄力，我方全體賦予 2 個怪力",
      charge: ["尊嚴","尊嚴"]
    },
    {
      name: "狗頭人打擊",
      cost: ["尊嚴"],
      effect: "對敵人造成 2 傷害；若自己上一回合也使用過同名卡牌，則基礎傷害變為 7 倍，施加虛弱",
      charge: ["尊嚴"]
    },
    {
      name: "廣域護盾",
      cost: null,
      effect: "我方全體賦予 10 格擋，永久從牌組中移除",
      charge: ["智慧"]
    },
    {
      name: "廣域治療",
      cost: ["慈悲"],
      effect: "為我方全體回復 15 HP，永久從牌組中移除",
      charge: ["慈悲"]
    },
    {
      name: "一人成群踐踏",
      cost: ["尊嚴", "尊嚴", "尊嚴"],
      effect: "對敵人造成 40 傷害，永久從牌組中移除",
      charge: null
    }
  ];