const MerchantCards = [
  {
    name: "穿刺槍擊",
    cost: null,
    effect: "對敵人造成 3 傷害",
    charge: ["慈悲"]
  },
  {
    name: "防禦",
    cost: null,
    effect: "自身獲得 4 格擋",
    charge: ["慈悲"]
  },
  {
    name: "黃金投擲",
    cost: ["慈悲"],
    effect: "對所有敵人造成每層 4 傷害，每層失去 40G；因 GOLD 不足而減少傷害",
    charge: ["慈悲"]
  },
  {
    name: "蓄力",
    cost: null,
    effect: "自身獲得 1 格擋，獲得怪力",
    charge: ["正義"]
  },
  {
    name: "附魔",
    cost: null,
    effect: "一名友軍賦予 1 格擋，自身獲得頑強",
    charge: ["尊嚴"]
  },
  {
    name: "以太之槍",
    cost: ["慈悲"],
    effect: "對敵人造成 4 傷害",
    charge: ["慈悲","慈悲"]
  },
  {
    name: "開盤交易",
    cost: ["慈悲"],
    effect: "對敵人造成 9 傷害，丟棄所有手牌，下一次抽牌變為 1 張",
    charge: ["慈悲","慈悲"]
  },
  {
    name: "風險對沖",
    cost: ["慈悲"],
    effect: "自身獲得 2 格擋，獲得 2 個風險對沖",
    charge: ["慈悲"]
  },
  {
    name: "粉碎槍擊",
    cost: ["正義"],
    effect: "對敵人造成 6 傷害；若目標的格擋被破壞，追加施加 2 個虛弱",
    charge: ["正義"]
  },
  {
    name: "雙螺旋",
    cost: ["智慧"],
    effect: "對敵人造成 3 傷害，攻擊 2 次",
    charge: ["智慧"]
  },
  {
    name: "貪婪",
    cost: ["慈悲","慈悲","慈悲"],
    effect: "自身獲得 2 格擋，獲得貪婪，暫時從牌組中移除",
    charge: ["慈悲"]
  },
  {
    name: "幸運之槍S",
    cost: ["慈悲", "慈悲"],
    effect: "對敵人造成 7 傷害，造成卡牌掉落等級 × 1 的傷害",
    charge: ["慈悲", "慈悲"]
  },
  {
    name: "幸運之槍I",
    cost: ["慈悲", "慈悲"],
    effect: "對敵人造成 7 傷害，造成道具掉落等級 × 1 的傷害",
    charge: ["慈悲", "慈悲"]
  },
  {
    name: "幸運之槍A",
    cost: ["慈悲", "慈悲"],
    effect: "對敵人造成 7 傷害，造成能力掉落等級 × 1 的傷害",
    charge: ["慈悲", "慈悲"]
  },
  {
    name: "幸運之槍G",
    cost: ["慈悲", "慈悲"],
    effect: "對敵人造成 7 傷害，造成 GOLD 掉落等級 × 1 的傷害",
    charge: ["慈悲", "慈悲"]
  },
  {
    name: "奇蹟卡正義",
    cost: ["慈悲", "正義", "正義"],
    effect: "對敵人造成我方全體手牌中正義屬性卡數量 × 3 的傷害",
    charge: ["正義"]
  },
  {
    name: "奇蹟卡尊嚴",
    cost: ["慈悲", "尊嚴", "尊嚴"],
    effect: "對敵人造成我方全體手牌中尊嚴屬性卡數量 × 3 的傷害",
    charge: ["尊嚴"]
  },
  {
    name: "奇蹟卡智慧",
    cost: ["慈悲", "智慧", "智慧"],
    effect: "對敵人造成我方全體手牌中智慧屬性卡數量 × 3 的傷害",
    charge: ["智慧"]
  },
  {
    name: "奇蹟卡慈悲",
    cost: ["慈悲", "慈悲", "慈悲"],
    effect: "對敵人造成我方全體手牌中慈悲屬性卡數量 × 3 的傷害",
    charge: ["慈悲"]
  },
  {
    name: "快速突刺",
    cost: ["尊嚴", "尊嚴"],
    effect: "對敵人造成 6 傷害，自身獲得盜賊之心，追擊",
    charge: ["尊嚴"]
  },
  {
    name: "黃金詛咒",
    cost: ["智慧", "智慧"],
    effect: "所有敵人施加弱化；若目標無格擋，追加施加弱化",
    charge: ["智慧"]
  },
  {
    name: "折扣",
    cost: ["慈悲", "慈悲"],
    effect: "自身獲得頑強，使用牌堆最上方的卡牌而不消耗 Will",
    charge: ["尊嚴","正義","慈悲"]
  },
  {
    name: "重擊衝撞",
    cost: ["正義", "正義"],
    effect: "對敵人造成 9 傷害，施加束縛",
    charge: ["正義"]
  },
  {
    name: "分析",
    cost: ["慈悲"],
    effect: "敵人施加弱化，虛弱；若目標無格擋，追加施加虛弱",
    charge: ["慈悲","慈悲"]
  },
  {
    name: "雷霆之槍",
    cost: ["智慧", "智慧"],
    effect: "對敵人造成 10 傷害，施加感電×2，暫時從牌組中移除",
    charge: ["智慧"]
  },
  {
    name: "強力附魔",
    cost: ["尊嚴", "尊嚴"],
    effect: "一名友軍賦予 4 格擋，自身獲得怪力，頑強",
    charge: ["尊嚴"]
  },
  {
    name: "奧義交易",
    cost: ["慈悲", "慈悲"],
    effect: "所有敵人施加弱化，虛弱，行動順序反轉",
    charge: ["慈悲"]
  },
  {
    name: "黃金之槍",
    cost: ["慈悲", "慈悲"],
    effect: "對敵人造成 12 傷害，暫時將黃金投擲加入牌組中的隨機位置",
    charge: null
  },
  {
    name: "烈焰之槍",
    cost: ["智慧", "智慧"],
    effect: "對敵人造成 9 傷害，施加灼傷",
    charge: ["智慧"]
  },
  {
    name: "超量蓄力",
    cost: ["慈悲","慈悲","慈悲"],
    effect: "一名友軍賦予 2 個怪力，蓄力，暫時將黃金投擲加入牌組中的隨機位置",
    charge: ["慈悲","慈悲"]
  },
  {
    name: "黃金狂潮",
    cost: ["慈悲","慈悲","慈悲"],
    effect: "對所有敵人造成 7 傷害，對所有敵人造成等同於當前牌堆張數的傷害",
    charge: ["慈悲"]
  },
  {
    name: "星界穿刺",
    cost: ["慈悲", "慈悲"],
    effect: "對敵人造成 9 傷害，無視格擋，施加 2 個虛弱",
    charge: null
  },
  {
    name: "稀有之力",
    cost: ["正義", "慈悲", "慈悲"],
    effect: "對敵人造成我方全體手牌中稀有卡數量 × 5 的傷害",
    charge: ["正義"]
  },
];