const SeekerCards = [
  {
    name: "淨化之劍",
    cost: null,
    effect: "對敵人造成 2 傷害，對敵人造成依手牌中*的數量 × 1 傷害",
    charge: ["慈悲"]
  },
  {
    name: "防禦蟲",
    cost: null,
    effect: "■ 蟲卡牌：* 自身獲得 4 格擋",
    charge: ["智慧"]
  },
  {
    name: "眼球不停抽動",
    cost: null,
    effect: "敵人施加眼球不停抽動，自身獲得眼球不停抽動",
    charge: ["正義"]
  },
  {
    name: "天使槍",
    cost: null,
    effect: "必定使敵人立即死亡，自身獲得罪，永久從牌組中移除",
    charge: ["慈悲"]
  },
  {
    name: "連斬之劍",
    cost: null,
    effect: "對敵人造成 2 傷害，攻擊 2 次，對自身造成 1 傷害",
    charge: ["慈悲"]
  },
  {
    name: "攻守之大衣",
    cost: ["尊嚴"],
    effect: "自身獲得 5 格擋，獲得怪力，頑強",
    charge: ["尊嚴"]
  },
  {
    name: "蟲之箱",
    cost: null,
    effect: "■ 蟲卡牌：** 暫時將防禦蟲、意志蟲、蟲之劍、共鳴蟲、特殊蟲、守護蟲加入牌組頂端",
    charge: ["智慧"]
  },
  {
    name: "雷鳴之劍",
    cost: ["智慧"],
    effect: "對敵人造成 7 傷害，施加依手牌中*的數量感電",
    charge: ["智慧","智慧"]
  },
  {
    name: "投擲石骨",
    cost: ["慈悲"],
    effect: "對敵人造成2傷害，若目標處於不要失去理智狀態，額外造成每層 × 3 傷害",
    charge: ["慈悲"]
  },
  {
    name: "意志蟲",
    cost: ["正義"],
    effect: "■ 蟲卡牌：** 充能 Will",
    charge: ["正義","慈悲","慈悲"]
  },
  {
    name: "惡魔之劍",
    cost: ["慈悲"],
    effect: "偷取道具，對敵人造成 7 傷害",
    charge: ["慈悲"]
  },
  {
    name: "不要失去理智",
    cost: ["尊嚴"],
    effect: "自身獲得不要失去理智，頑強，純淨之壁，敵人施加不要失去理智",
    charge: ["尊嚴","智慧"]
  },
  {
    name: "冰結之劍",
    cost: ["慈悲"],
    effect: "對敵人造成 6 傷害，施加依手牌中*的數量凍傷",
    charge: ["慈悲"]
  },
  {
    name: "投擲腐肉骨",
    cost: ["正義", "正義"],
    effect: "若目標處於不要失去理智狀態，造成每層 × 5 傷害，施加弱化，虛弱",
    charge: null
  },
  {
    name: "大爆刑具",
    cost: ["正義", "正義"],
    effect: "對所有敵人造成 9 傷害",
    charge: ["正義"]
  },
  {
    name: "蟲之劍",
    cost: ["慈悲","慈悲"],
    effect: "■ 蟲卡牌：* 對敵人造成 6 傷害；對敵人造成依手牌中*的數量 × 3 傷害",
    charge: ["慈悲"]
  },
  {
    name: "共鳴蟲",
    cost: ["智慧"],
    effect: "■ 蟲卡牌：** 自身獲得 8 格擋，獲得依手牌中*的數量怪力",
    charge: ["智慧"]
  },
  {
    name: "特殊蟲",
    cost: ["智慧"],
    effect: "■ 蟲卡牌：* 自身獲得8格擋，暫時獲得能力蟲之守護",
    charge: ["智慧"]
  },
  {
    name: "玻璃之劍",
    cost: ["慈悲", "慈悲"],
    effect: "對敵人造成 16 傷害，暫時從牌組中移除",
    charge: null
  },
  {
    name: "炎淨之劍",
    cost: ["正義", "正義"],
    effect: "對敵人造成 12 傷害，施加依手牌中*的數量灼傷",
    charge: ["正義","智慧"]
  },
  {
    name: "你又死了嗎……？",
    cost: ["尊嚴", "智慧"],
    effect: "自身獲得忍受，暫時將天使槍加入牌組頂端，暫時從牌組中移除",
    charge: ["智慧"]
  },
  {
    name: "革命之液",
    cost: ["慈悲","慈悲"],
    effect: "將自身的已損失 HP 與目前 HP 互換",
    charge: ["慈悲"]
  },
  {
    name: "食糧紋樣",
    cost: ["尊嚴","尊嚴"],
    effect: "隨機獲得 1 個食物道具，永久從牌組中移除",
    charge: ["尊嚴","尊嚴","尊嚴"]
  },
  {
    name: "守護蟲",
    cost: ["智慧","智慧"],
    effect: "■ 蟲卡牌：* 自身獲得 6 格擋，獲得依手牌中*的數量 × 2 格擋",
    charge: ["慈悲","智慧","智慧"]
  },
  {
    name: "三層之劍",
    cost: ["慈悲","慈悲"],
    effect: "對敵人造成 9 傷害，施加灼傷，凍傷，感電",
    charge: ["慈悲"]
  },
  {
    name: "扭曲之大衣",
    cost: ["智慧", "智慧", "智慧"],
    effect: "自身獲得 10 格擋，暫時獲得能力扭曲之守護",
    charge: ["智慧","智慧"]
  },
  {
    name: "咬石骨",
    cost: null,
    effect: "為自身回復 5 HP，獲得缺牙",
    charge: ["慈悲"]
  },
  {
    name: "咬腐肉骨",
    cost: ["正義"],
    effect: "為自身回復 10 HP，獲得弱化，虛弱",
    charge: ["正義","慈悲"]
  }
];