const SniperCards = [
    {
      name: "快速子彈",
      cost: null,
      effect: "對敵人造成 2 傷害；若為首回合，額外造成 7 傷害",
      charge: ["智慧"]
    },
    {
      name: "格擋姿態",
      cost: null,
      effect: "自身獲得 6 格擋，獲得弱化",
      charge: ["智慧"]
    },
    {
      name: "破防射擊",
      cost: ["正義"],
      effect: "敵人失去 6 格擋，對敵人造成 4 傷害",
      charge: ["正義"]
    },
    {
      name: "鷹眼",
      cost: null,
      effect: "一名友軍賦予鷹眼，自身獲得弱化",
      charge: ["智慧"]
    },
    {
      name: "黑夜驚懼",
      cost: ["智慧"],
      effect: "對敵人造成 4 傷害；若自身處於潛行或虛弱 狀態，對目標造成每層 × 5 傷害",
      charge: ["智慧"]
    },
    {
      name: "暗影步伐",
      cost: ["慈悲"],
      effect: "自身獲得潛行，暫時獲得能力策謀",
      charge: ["慈悲"]
    },
    {
      name: "火焰射擊",
      cost: ["智慧"],
      effect: "對敵人造成 5 傷害；對SKILL的目標追加施加灼傷×2",
      charge: ["智慧"]
    },
    {
      name: "隱匿披風",
      cost: ["尊嚴"],
      effect: "賦予自身等同於當前牌堆張數的格擋，獲得潛行，暫時從牌組中移除",
      charge: ["尊嚴"]
    },
    {
      name: "影縫之箭",
      cost: ["慈悲"],
      effect: "對敵人造成 8 傷害，施加束縛，暫時從牌組中移除",
      charge: ["慈悲"]
    },
    {
      name: "冰霜射擊",
      cost: ["智慧"],
      effect: "對敵人造成 5 傷害；對SKILL的目標追加施加凍傷×2",
      charge: ["智慧"]
    },
    {
      name: "快速填裝",
      cost: ["正義"],
      effect: "自身獲得追擊，警戒，暫時將狙擊射擊加入牌組頂端，暫時從牌組中移除",
      charge: ["正義"]
    },
    {
      name: "箭雨",
      cost: ["智慧","智慧"],
      effect: "對所有敵人造成 5 傷害，對ATTACK的目標額外造成 5 傷害",
      charge: ["智慧"]
    },
    {
      name: "狙擊之眼",
      cost: ["智慧","慈悲"],
      effect: "自身獲得狙擊，虛弱，暫時將狙擊射擊加入牌組頂端",
      charge: ["慈悲"]
    },
    {
      name: "以太狙擊",
      cost: ["尊嚴", "尊嚴"],
      effect: "對敵人造成你當前 HP ÷ 4 的傷害",
      charge: ["尊嚴"]
    },
    {
      name: "潛伏",
      cost: ["智慧", "智慧"],
      effect: "自身獲得潛行，鷹之眼，狙擊，虛弱",
      charge: ["智慧"]
    },
    {
      name: "狙擊射擊",
      cost: ["正義", "正義"],
      effect: "敵人失去 7 格擋，對敵人造成 8 傷害，無視格擋",
      charge: ["正義"]
    },
    {
      name: "劇毒之箭",
      cost: ["慈悲", "慈悲"],
      effect: "對ATTACK的目標造成 12 傷害；對SKILL的目標追加施加中毒，2個虛弱，暫時從牌組中移除",
      charge: ["慈悲"]
    },
    {
      name: "狂月",
      cost: null,
      effect: "自身獲得 2 個怪力，策謀，解除自身 2 個異常狀態，暫時從牌組中移除",
      charge: ["尊嚴"]
    },
    {
      name: "雷光崛起",
      cost: ["智慧", "智慧"],
      effect: "對敵人造成 9 傷害；對SKILL的目標追加施加感電×2",
      charge: ["智慧"]
    },
    {
      name: "幻影披風",
      cost: ["尊嚴", "智慧"],
      effect: "自身獲得 7 格擋，獲得強盾",
      charge: ["尊嚴"]
    },
    {
      name: "麻痺箭矢",
      cost: ["智慧", "智慧"],
      effect: "對敵人造成 6 傷害，施加麻痺，暫時從牌組中移除",
      charge: ["智慧"]
    },
    {
      name: "爆頭射擊",
      cost: ["智慧", "智慧", "智慧"],
      effect: "對敵人造成 10 傷害；對SKILL的目標額外造成 13 傷害，暫時從牌組中移除",
      charge: ["智慧"]
    },
    {
      name: "星界箭矢",
      cost: ["正義", "正義", "正義"],
      effect: "對敵人造成 15 傷害，解除敵人 2 個有益狀態",
      charge: ["正義"]
    },
    {
      name: "安多芬",
      cost: ["智慧", "智慧", "智慧"],
      effect: "自身獲得怪力，必殺，狙擊，虛弱，暫時將爆頭射擊α 加入牌組頂端",
      charge: ["智慧"]
    },
    {
      name: "血雨",
      cost: ["正義", "智慧", "智慧"],
      effect: "對ATTACK的目標造成 13 傷害；對SKILL的目標追加施加中毒，弱化， 2 個虛弱，暫時從牌組中移除",
      charge: ["智慧"]
    },
    {
      name: "爆頭射擊α",
      cost: null,
      effect: "對敵人造成 9 傷害；對SKILL的目標額外造成 12 傷害，暫時從牌組中移除",
      charge: ["智慧"]
    }
  ];