const ThiefCards = [
  {
    name: "匕首雙擊",
    cost: null,
    effect: "對敵人造成 1 傷害，攻擊 2 次",
    charge: ["慈悲"]
  },
  {
    name: "偷竊",
    cost: null,
    effect: "偷取道具，自身獲得盜賊之心",
    charge: ["慈悲"]
  },
  {
    name: "逃跑",
    cost: null,
    effect: "從戰鬥中逃脫，我方全體獲得 2 DP，永久從牌組中移除",
    charge: ["尊嚴"]
  },
  {
    name: "快速攻擊",
    cost: null,
    effect: "對敵人造成 3 傷害，自身獲得盜賊之心",
    charge: ["正義"]
  },
  {
    name: "毒匕首",
    cost: ["慈悲"],
    effect: "對敵人造成 3 傷害，施加中毒",
    charge: ["慈悲"]
  },
  {
    name: "跳斬",
    cost: ["慈悲"],
    effect: "對敵人造成 5 傷害；若自身處於盜賊之心狀態，對目標額外造成每層 × 5 傷害",
    charge: ["慈悲"]
  },
  {
    name: "偷錢",
    cost: null,
    effect: "偷取金幣，自身獲得盜賊之心",
    charge: ["慈悲","慈悲"]
  },
  {
    name: "狙擊腿部",
    cost: ["尊嚴"],
    effect: "對敵人造成 4 傷害，施加束縛，降速化",
    charge: ["尊嚴"]
  },
  {
    name: "隱匿",
    cost: ["智慧"],
    effect: "自身獲得潛行，盜賊之心，暗殺",
    charge: ["智慧"]
  },
  {
    name: "匕首舞",
    cost: ["慈悲"],
    effect: "對敵人造成 3 傷害，攻擊 2 次；若自身處於盜賊之心狀態，對目標造成每層 × 8 傷害",
    charge: ["慈悲"]
  },
  {
    name: "偷取防禦",
    cost: ["智慧"],
    effect: "偷取格擋，自身獲得盜賊之心",
    charge: ["慈悲", "慈悲"]
  },
  {
    name: "調製炸藥",
    cost: ["慈悲"],
    effect: "暫時將危險炸藥α 加入牌組頂端，獲得熱血",
    charge: ["尊嚴"]
  },
  {
    name: "危險炸藥",
    cost: ["慈悲"],
    effect: "對所有敵人造成 4 傷害，施加灼傷",
    charge: ["慈悲"]
  },
  {
    name: "奪取意志",
    cost: ["慈悲"],
    effect: "自身獲得盜賊之心，光機之雨",
    charge: ["慈悲","慈悲", "慈悲"]
  },
  {
    name: "擲錢攻擊",
    cost: ["尊嚴", "智慧"],
    effect: "對所有敵人造成每層 10 傷害，每層失去 100G；因 GOLD 不足而減少傷害",
    charge: ["正義","正義"]
  },
  {
    name: "舉手威嚇",
    cost: ["尊嚴", "尊嚴"],
    effect: "所有敵人施加束縛，虛弱，解除所有敵人 1 個有益狀態",
    charge: ["尊嚴"]
  },
  {
    name: "煽動",
    cost: ["智慧","慈悲"],
    effect: "一名友軍賦予挑釁，憤怒",
    charge: ["智慧"]
  },
  {
    name: "搶劫金錢",
    cost: ["慈悲"],
    effect: "偷取金幣，對敵人造成 6 傷害",
    charge: ["慈悲"]
  },
  {
    name: "搶劫",
    cost: ["慈悲"],
    effect: "偷取道具，對敵人造成 6 傷害",
    charge: ["慈悲"]
  },
  {
    name: "強襲",
    cost: ["慈悲"],
    effect: "對敵人造成 6 傷害；若目標處於降速化狀態，額外造成每層 × 9 傷害",
    charge: ["慈悲"]
  },
  {
    name: "追擊",
    cost: ["正義", "正義"],
    effect: "自身獲得追擊，暗殺",
    charge: ["正義"]
  },
  {
    name: "麻痺匕首",
    cost: ["正義","正義","正義"],
    effect: "對敵人造成 9 傷害，施加麻痺，暫時從牌組中移除",
    charge: ["正義"]
  },
  {
    name: "偷光一切",
    cost: ["慈悲"],
    effect: "偷取道具，偷取金幣",
    charge: ["慈悲"]
  },
  {
    name: "亂舞手裏劍",
    cost: ["正義", "慈悲", "慈悲"],
    effect: "對所有敵人造成 13 傷害；若目標處於束縛或降速化狀態，額外造成每層 × 10 傷害",
    charge: ["慈悲"]
  },
  {
    name: "劇毒巨蛇",
    cost: ["尊嚴","慈悲","慈悲"],
    effect: "對敵人造成 10 傷害，施加劇毒，暫時從牌組中移除",
    charge: ["慈悲"]
  },
  {
    name: "奪命",
    cost: ["慈悲","慈悲","慈悲"],
    effect: "對敵人造成 10 傷害，極低機率即死，暫時從牌組中移除",
    charge: ["慈悲"]
  },
  {
    name: "撕裂之舞",
    cost: ["尊嚴","慈悲","慈悲"],
    effect: "對敵人造成 4 傷害，攻擊 3 次，暫時從牌組中移除",
    charge: ["慈悲"]
  },
  {
    name: "危險炸藥α",
    cost: null,
    effect: "對所有敵人造成 10 傷害，施加灼傷",
    charge: ["正義"]
  },
  {
    name: "奪取狀態變化",
    cost: ["慈悲"],
    effect: "從敵人偷取 2 個有益狀態，自身獲得盜賊之心",
    charge: ["慈悲"]
  },
  {
    name: "劇毒刺擊",
    cost: ["慈悲","慈悲"],
    effect: "對敵人造成 5 傷害；若目標處於中毒，劇毒或信仰之毒狀態，額外造成每層 × 4 傷害",
    charge: ["慈悲"]
  },
];